stress-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # Simula 5 novos usuários chegando a cada segundo, durante 20 segundos.
    # Isso resultará em 100 uploads (5 * 20).
    - duration: 20
      arrivalRate: 5
scenarios:
  - name: "Upload de Imagem"
    flow:
      - post:
          url: "/upload"
          # Esta é a parte chave: define a requisição como multipart/form-data
          multipart:
            # Cada item aqui é uma "parte" do formulário
            - name: "image" # O nome do campo, deve ser o mesmo que no multer ('image')
              path: "" # O caminho para o arquivo que será enviado